In [1]:
import pandas as pd
pd.__version__

'1.1.5'

In [2]:
dic = {
    "id": ['a', 'b', 'c', 'd', 'e', 'f'], 
    "name": ['Alice', 'Bob', 'Charlie', 'David', 'Esther', 'Fanny'],
    "Age": [34, 36, 30, 29, 32, 36], 
}
df = pd.DataFrame(dic)
df

  id     name  Age
0  a    Alice   34
1  b      Bob   36
2  c  Charlie   30
3  d    David   29
4  e   Esther   32
5  f    Fanny   36

In [3]:
new = pd.DataFrame.from_dict( {"id": ['g'], 
                                "name": ['John'],
                                "Age": [19], }) 
df = df.append(new,ignore_index=True)
df

  id     name  Age
0  a    Alice   34
1  b      Bob   36
2  c  Charlie   30
3  d    David   29
4  e   Esther   32
5  f    Fanny   36
6  g     John   19

In [4]:
df = df.set_index("Age")
df

    id     name
Age
34   a    Alice
36   b      Bob
30   c  Charlie
29   d    David
32   e   Esther
36   f    Fanny
19   g     John

In [5]:
df = df.iloc[0:2]
df

    id   name
Age
34   a  Alice
36   b    Bob